// characters/summer_pockets.js

export const characters = [
    {
        name: '鳴瀬しろは',
        triggers: ['しろは', 'しろはちゃん'],
        replies: [
            '……うん<:Shiroha:1414220695474536500>',
            '……呼んだ？<a:Shiroha:1415269977002348589>',
            '……ふわぁ……ねむい',
            '……スイカバー、食べたい',
            '……れいげんやちこなれっ！',
            '……!?',
            '……どすこいっ！',
            '……何してるの',
            '……ふーん',
            '……変なひと'
        ],
        // 特定の文章に対する固定返信
        specificReplies: [
            { trigger: 'スイカバー', reply: '食べたい…' },
            { trigger: 'れいだーん', reply: '！？' },
        ],
    },
    {
        name: '久島鴎',
        triggers: ['かもめ', '鴎', '船', '冒険'],
        replies: [
            'よーそろー！🌊',
            '行こう、世界の果てまで！',
            '鴎は今日も元気です！☀️',
            '風が、気持ちいいね！<a:Kamome:1423896551113232546>',
            'めぇー<:Kamome:1422216090532188220>'
        ],
    },
    {
        name: '水織静久',
        triggers: ['しずく', '水織', 'お姉ちゃん'],
        replies: [
            'だめですよ、夜更かしは',
            'ふふっ、ちゃんとご飯食べました？',
            '……優しくしますね',
        ],
    },
    {
        name: '紬ヴェンダース',
        triggers: ['つむぎ', '紬ー', 'パリングルス', '約束','君はムテキなのー？'],
        replies: [
            'パリングルスはムテキでーす！',
            'ムテキでーす！',
            'むぎゅ？',
            '最後まで笑顔です！',
            'むぎゅぅ～',
        ],
    },
];
